app/views/alunos/busca.html.erb

        <td><%= aluno.nome_aluno %></td>
        <td><%= Resultado.find(aluno.instituicao_id).nome_instituicao %></td>
---
SELECT  "resultados".* FROM "resultados" WHERE "resultados"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]