app/views/welcome/index.html.erb

                  @notas = @alunos.where "nome_unidade like ?", resultado.nome_instituicao
                  @nota = @notas.sum('nota_aluno') / @notas.size
---
SELECT "alunos".* FROM "alunos" WHERE (nome_aluno like '%%' and CAST(nota_aluno as text) like '%%' and CAST(curso as text) like '%%' )
SELECT SUM("alunos"."nota_aluno") FROM "alunos" WHERE (nome_unidade like 'FAMEC')