app/views/resultados/busca.html.erb

                    @notas = @alunos.where "nome_unidade like ?", resultado.nome_instituicao
                    @nota = @notas.sum('nota_aluno') / @notas.size
---
SELECT SUM("alunos"."nota_aluno") FROM "alunos" WHERE (nome_unidade like 'FAMEC')