app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos"
---
  def index
    @alunos = Aluno.all

SELECT "alunos".* FROM "alunos" WHERE (nome_aluno like '%ter%' and CAST(instituicao_id as text) like '%2%' and CAST(nota_aluno as text) like '%%' and CAST(curso as text) like '%%' )
SELECT SUM("alunos"."nota_aluno") FROM "alunos" WHERE (nome_unidade like 'Unicesumar')
---
  def busca
    @resultados = Resultado.all
    @nome_aluno = params[:nome_aluno]
    @nota_aluno = params[:nota_aluno]
    @curso = params[:curso]
    @alunos = Aluno.where "nome_aluno like ? and CAST(nota_aluno as text) like ? and CAST(curso as text) like ? ", "%#{@nome_aluno}%", "%#{@nota_aluno}%", "%#{@curso}%"

SELECT "resultados".* FROM "resultados"
---
  def new
    @aluno = Aluno.new
    @resultados = Resultado.all

SELECT  "resultados".* FROM "resultados" WHERE "resultados"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "alunos" ("instituicao_id", "nome_aluno", "nota_aluno", "curso", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["instituicao_id", 2], ["nome_aluno", "ter"], ["nota_aluno", "1.0"], ["curso", "cr"], ["created_at", "2017-07-29 17:42:54.313381"], ["updated_at", "2017-07-29 17:42:54.313381"]]
SELECT SUM("alunos"."nota_aluno") FROM "alunos" WHERE (instituicao_id = '1')
SELECT SUM("resultados"."media_alunos") FROM "resultados" WHERE (nome_instituicao like 'FAMEC')
UPDATE "resultados" SET "media_alunos" = $1, "updated_at" = $2 WHERE "resultados"."id" = $3  [["media_alunos", "10.0"], ["updated_at", "2017-07-30 16:50:41.755730"], ["id", 1]]
---
  def create
    @aluno = Aluno.new


    @aluno.nome_aluno = params[:nome_aluno]

    @instituicao_curso = params[:instituicao_id]

    @aluno.instituicao_id = @instituicao_curso
    # Guardando instituicao para calculo de resultados e pegar nome do curso
    @resultado_curso = Resultado.find(@instituicao_curso)
    @aluno.nome_unidade = @resultado_curso.nome_instituicao

    @aluno.curso = @resultado_curso.nome_curso
    @aluno.nota_aluno = params[:nota_aluno].to_f

    if @aluno.nota_aluno > 10.0
      @aluno.nota_aluno  = 10.0
    end
      @aluno.save
    # Calculando media alunos curso



    @notas_dos_alunos = Aluno.where "instituicao_id = ?", @instituicao_curso

    # Nome da instituição para calculo de nota geral
    @nome_da_instituicao = @resultado_curso.nome_instituicao

    @resultado_curso.media_alunos = @notas_dos_alunos.sum('nota_aluno') / @notas_dos_alunos.size
    @resultado_curso.save

DELETE FROM "alunos" WHERE "alunos"."id" = $1  [["id", 2]]
---
  def destroy
    id = params[:id]
    Aluno.destroy id