app/controllers/alunos_controller.rb

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_aluno
      @aluno = Aluno.find(params[:id])