app/controllers/resultados_controller.rb

  def index
    @resultadosQ = Resultado.where "nome_instituicao like ? and CAST(nota_geral as text) like ? and nome_curso like ? and CAST(nota_curso as text) like ? and CAST(media_alunos as text) like ?", "%#{@nome_instituicao}%", "%#{@nota_geral}%", "%#{@nome_curso}%", "%#{@nota_curso}%", "%#{@media_alunos}%"
    @resultados = @resultadosQ.order('nota_geral DESC')
    @alunos = Aluno.all
---
SELECT "resultados".* FROM "resultados" WHERE (nome_instituicao like '%%' and CAST(nota_geral as text) like '%%' and nome_curso like '%%' and CAST(nota_curso as text) like '%%' and CAST(media_alunos as text) like '%%') ORDER BY nota_geral DESC
SELECT SUM(media_alunos) FROM "alunos" WHERE (nome_instituicao like 'Unicesumar')

  def create
    valores = params.require("resultado").permit :nome_instituicao, :nota_geral, :nome_curso, :nota_curso, :media_alunos, :instituicao_id
    resultado = Resultado.create valores
---
INSERT INTO "resultados" ("nome_instituicao", "nota_geral", "nome_curso", "media_alunos", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome_instituicao", "RE"], ["nota_geral", "0.0"], ["nome_curso", "RE"], ["media_alunos", "0.0"], ["created_at", "2017-07-31 11:29:09.201180"], ["updated_at", "2017-07-31 11:29:09.201180"]]

  def destroy
    id = params[:id]
    Resultado.destroy id
---
DELETE FROM "resultados" WHERE "resultados"."id" = ?  [["id", 4]]

  def busca
    @alunos = Aluno.all
    @nome_instituicao = params[:nome_instituicao]
    @nota_geral = params[:nota_geral]
    @nome_curso = params[:nome_curso]
    @nota_curso = params[:nota_curso]
    @media_alunos = params[:media_alunos]
    @resultadosQ = Resultado.where "nome_instituicao like ? and CAST(nota_geral as text) like ? and nome_curso like ? and CAST(nota_curso as text) like ? and CAST(media_alunos as text) like ?", "%#{@nome_instituicao}%", "%#{@nota_geral}%", "%#{@nome_curso}%", "%#{@nota_curso}%", "%#{@media_alunos}%"
---
SELECT "resultados".* FROM "resultados" WHERE (nome_instituicao like '%UFBA%' and CONVERT(varchar(20), nota_geral) like '%%' and nome_curso like '%%' and CONVERT(varchar(20),nota_curso) like '%%' and CONVERT(varchar(20),media_alunos) like '%%' )