app/controllers/welcome_controller.rb

  def index
    @resultados = Resultado.all.order('nota_geral DESC')
---
SELECT "resultados".* FROM "resultados" ORDER BY nota_geral DESC