app/controllers/welcome_controller.rb

SELECT "resultados".* FROM "resultados" ORDER BY media_alunos DESC
---
  def index
    @resultados = Resultado.all.order('media_alunos DESC')